Repository: tdawn0-0/FinderActions
Catalog: Apps/Host/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %lld actions ready in Finder
zh_hans: %lld 个动作在访达中就绪

source: 1. Allow access to protected folders
zh_hans: 1. 允许访问受保护文件夹

source: 1. Open Full Disk Access in macOS System Settings.
zh_hans: 1. 在 macOS 系统设置中打开“完全磁盘访问权限”。

source: 2. Click + and select FinderActions.app, or drag the app into the list.
zh_hans: 2. 点击 + 并选择 FinderActions.app，或直接将应用拖入列表中。

source: 2. Enable the Finder extension
zh_hans: 2. 启用访达扩展

source: 3. Turn FinderActions on.
zh_hans: 3. 开启 FinderActions 权限开关。

source: About
zh_hans: 关于

source: Action Name
zh_hans: 动作名称

source: Action Type
zh_hans: 动作类型

source: Action Type:
zh_hans: 动作类型：

source: Actions
zh_hans: 动作管理

source: Actions (%lld)
zh_hans: 动作 (%lld)

source: Actions run from Finder will be recorded here.
zh_hans: 在访达中运行的动作将记录在此处。

source: Activity Logs
zh_hans: 运行日志

source: Add Custom Editor…
zh_hans: 添加自定义编辑器…

source: Add New Action
zh_hans: 新建动作

source: All
zh_hans: 全部

source: Always
zh_hans: 始终显示

source: AppleScript
zh_hans: AppleScript 脚本

source: Application
zh_hans: 外部应用程序

source: Applications
zh_hans: 外部应用

source: Built-in
zh_hans: 内置功能

source: Built-in Identifier: %@
zh_hans: 内置标识符：%@

source: Bundle ID:
zh_hans: Bundle 标识符：

source: Cancel
zh_hans: 取消

source: Choose Other Terminal…
zh_hans: 选择其他终端应用…

source: Clear
zh_hans: 清空

source: Code Editors & IDEs
zh_hans: 代码编辑器与 IDE

source: Configure default terminal in the Applications tab.
zh_hans: 请在“外部应用”页面中配置默认终端。

source: Default Terminal
zh_hans: 默认终端

source: Delete Selected Action
zh_hans: 删除所选动作

source: Disabled
zh_hans: 已停用

source: Display & Matching
zh_hans: 显示与匹配规则

source: Displays right-click action items in Finder.
zh_hans: 用于在 macOS 访达右键菜单中渲染动作项。

source: Duplicate Action
zh_hans: 复制动作

source: Each enabled editor creates its own dedicated menu entry in Finder.
zh_hans: 每个启用的编辑器都会在访达右键菜单中生成专属的独立菜单项。

source: Enabled
zh_hans: 已启用

source: Execution Logic
zh_hans: 执行逻辑

source: Execution history stays strictly on this Mac.
zh_hans: 所有执行历史仅保留在本地设备上。

source: Extension & Permissions
zh_hans: 扩展与权限

source: Extension setup required
zh_hans: 需配置访达扩展

source: Factory Reset
zh_hans: 恢复出厂设置

source: Failed (%@)
zh_hans: 执行失败 (%@)

source: Fallback Path:
zh_hans: 回退路径：

source: Files Only
zh_hans: 仅选中文件时

source: Filter actions…
zh_hans: 过滤动作…

source: Finder always renders one single “Open in Terminal” menu item. Selected terminal will launch with the working directory.
zh_hans: 访达右键菜单中始终呈现唯一的“在终端中打开”项目，点击将使用所选终端打开工作目录。

source: FinderActions is completely offline. No telemetry, no accounts, and no data leaves your device.
zh_hans: FinderActions 完全离线运行。无遥测数据，无需账号，任何数据绝不离开您的设备。

source: FinderActions is installed in /Applications
zh_hans: FinderActions 已安装在 /Applications 应用程序目录

source: FinderActions Settings
zh_hans: FinderActions 设置

source: FinderSync Extension
zh_hans: FinderSync 扩展

source: Finish Setup
zh_hans: 完成设置

source: Folders Only
zh_hans: 仅选中文件夹时

source: Full Disk Access (FDA)
zh_hans: 完全磁盘访问权限 (FDA)

source: General
zh_hans: 通用设置

source: GitHub Repository
zh_hans: GitHub 开源仓库

source: Grants permission for scripts to access protected folders without prompts.
zh_hans: 授权脚本无弹窗访问受保护的系统文件夹与磁盘路径。

source: If the menu does not show after enabling in System Settings:
zh_hans: 如果在系统设置中启用后仍未显示右键菜单：

source: Installed
zh_hans: 已安装

source: Interpreter:
zh_hans: 解释器：

source: Live Test Console
zh_hans: 实时测试控制台

source: Manage Actions…
zh_hans: 管理动作…

source: Manifest Config
zh_hans: Manifest 配置文件

source: Menu Group:
zh_hans: 菜单分组：

source: MIT License
zh_hans: MIT 开源协议

source: Multiple Selection
zh_hans: 仅多选项目时

source: No Action Selected
zh_hans: 未选择动作

source: No Logs Found
zh_hans: 暂无日志记录

source: No actions found
zh_hans: 未找到匹配动作

source: No execution logs yet
zh_hans: 暂无执行日志

source: Not Found
zh_hans: 未找到

source: Not Installed
zh_hans: 未安装

source: Open Extension Settings
zh_hans: 打开扩展设置

source: Open Folder
zh_hans: 打开目录

source: Open Full Disk Access
zh_hans: 打开完全磁盘访问权限

source: Open Scripts Directory in Finder
zh_hans: 在访达中打开脚本目录

source: Open Scripts Folder
zh_hans: 打开脚本文件夹

source: Open Settings
zh_hans: 打开设置

source: Open System Settings → Extensions
zh_hans: 打开系统设置 → 扩展

source: Or Inline Script:
zh_hans: 或内联脚本代码：

source: Preferences
zh_hans: 通用偏好

source: Privacy & Offline
zh_hans: 隐私与离线安全

source: Quick Choose Symbol
zh_hans: 快速选择图标

source: Quit
zh_hans: 退出

source: Recent Logs (%lld)
zh_hans: 最近日志 (%lld)

source: Recommended: Move FinderActions to /Applications
zh_hans: 建议：将 FinderActions 移动到 /Applications 应用程序目录

source: Refresh Status
zh_hans: 刷新状态

source: Reset
zh_hans: 重置

source: Reset actions and application configurations back to the initial defaults.
zh_hans: 将所有动作与应用配置重置为初始默认值。

source: Reset all actions to default?
zh_hans: 确定要重置所有动作为默认配置吗？

source: Reset to Defaults
zh_hans: 恢复默认设置

source: Restart Finder
zh_hans: 重启访达

source: Reveal in Finder
zh_hans: 在访达中定位

source: Run Test
zh_hans: 运行测试

source: Running from Downloads or build folders can invalidate permissions on update.
zh_hans: 从下载或构建目录运行可能导致更新后权限失效。

source: Running…
zh_hans: 正在执行…

source: Runs against user home directory.
zh_hans: 将以当前用户主目录为参数执行测试。

source: Script File:
zh_hans: 脚本文件：

source: Scripts Folder
zh_hans: 脚本存放目录

source: Search actions…
zh_hans: 搜索动作…

source: Search logs…
zh_hans: 搜索日志…

source: Select an action to inspect its settings, edit scripts, and test run.
zh_hans: 从左侧选择一个动作以查看其配置、编辑脚本或测试执行。

source: Set up FinderActions
zh_hans: 设置 FinderActions

source: SF Symbol:
zh_hans: SF 符号图标：

source: Shell Script
zh_hans: Shell 脚本

source: Show in Finder
zh_hans: 在访达中显示

source: Show system notifications upon execution completion
zh_hans: 动作执行完成后发送系统通知

source: Show When:
zh_hans: 显示时机：

source: Single Selection
zh_hans: 仅单选项目时

source: Skip for Now
zh_hans: 稍后再说

source: Storage & Configurations
zh_hans: 存储与配置文件

source: Subtitle (Optional)
zh_hans: 副标题（可选）

source: Success
zh_hans: 成功

source: Success (%@)
zh_hans: 执行成功 (%@)

source: Terminal
zh_hans: 终端工具

source: Test run with Home folder
zh_hans: 以主目录测试运行

source: This will restore the default manifest and bundled scripts.
zh_hans: 此操作将恢复默认动作配置及内置脚本。

source: Troubleshooting Terminal Commands
zh_hans: 终端排错命令

source: Two quick system settings make Finder actions available across protected folders.
zh_hans: 仅需完成两项快捷系统配置，即可在受保护文件夹中顺畅使用访达右键动作。

source: Version 1.0.0 (Native)
zh_hans: 版本 1.0.0 (原生开发)
